In [24]:
#import necessary libraries
import pandas as pd
from sqlalchemy import create_engine

In [25]:
#bring in csv from files
streaming_csv = "Resources/MoviesOnStreamingPlatforms_updated.csv"
streaming_df = pd.read_csv(streaming_csv)
streaming_df.head()

#make column names lowercase
streaming_df.columns = streaming_df.columns.str.lower()

#convert rotten tomatoes rating to string (replace %) then convert to string and divide by 10 
streaming_df['rotten tomatoes']=streaming_df['rotten tomatoes'].str.replace(r'%', r'.0').astype('float') / 10.0

#sum of streaming columns to calculate total streaming platforms per movie
streaming_df['total_streaming_platforms']=streaming_df['netflix']+streaming_df['hulu']+streaming_df['prime video']+streaming_df['disney+']

streaming_df.head()

,unnamed: 0,id,title,year,age,imdb,rotten tomatoes,netflix,hulu,prime video,disney+,type,directors,genres,country,language,runtime,total_streaming_platforms
0,0,1,Inception,2010,13+,8.8,8.7,1,0,0,0,0,Christopher Nolan,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0,1
1,1,2,The Matrix,1999,18+,8.7,8.7,1,0,0,0,0,"Lana Wachowski,Lilly Wachowski","Action,Sci-Fi",United States,English,136.0,1
2,2,3,Avengers: Infinity War,2018,13+,8.5,8.4,1,0,0,0,0,"Anthony Russo,Joe Russo","Action,Adventure,Sci-Fi",United States,English,149.0,1
3,3,4,Back to the Future,1985,7+,8.5,9.6,1,0,0,0,0,Robert Zemeckis,"Adventure,Comedy,Sci-Fi",United States,English,116.0,1
4,4,5,"The Good, the Bad and the Ugly",1966,18+,8.8,9.7,1,0,1,0,0,Sergio Leone,Western,"Italy,Spain,West Germany",Italian,161.0,2

In [26]:
#drop unnecessary columns
new_streaming_df = streaming_df.drop(columns=['unnamed: 0','id','type','directors'])


new_streaming_df.head()

,title,year,age,imdb,rotten tomatoes,netflix,hulu,prime video,disney+,genres,country,language,runtime,total_streaming_platforms
0,Inception,2010,13+,8.8,8.7,1,0,0,0,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0,1
1,The Matrix,1999,18+,8.7,8.7,1,0,0,0,"Action,Sci-Fi",United States,English,136.0,1
2,Avengers: Infinity War,2018,13+,8.5,8.4,1,0,0,0,"Action,Adventure,Sci-Fi",United States,English,149.0,1
3,Back to the Future,1985,7+,8.5,9.6,1,0,0,0,"Adventure,Comedy,Sci-Fi",United States,English,116.0,1
4,"The Good, the Bad and the Ugly",1966,18+,8.8,9.7,1,0,1,0,Western,"Italy,Spain,West Germany",Italian,161.0,2

In [27]:
#bring in csv from files
IMDB_movies_csv = "Resources/IMDb_movies.csv"
IMDB_movies_df = pd.read_csv(IMDB_movies_csv)
IMDB_movies_df.head()

#drop unneccesarry columns
IMDB_movies_df1 = IMDB_movies_df[['imdb_title_id','title','year','description']].copy()

#clean year column
IMDB_movies_df1.loc[IMDB_movies_df1['year'] == 'TV Movie 2019']

new_IMDB_movies_df = IMDB_movies_df1.replace(to_replace='TV Movie 2019', value='2019')

#convert year to integer for merge
new_IMDB_movies_df['year'] = new_IMDB_movies_df['year'].astype('int64')

new_IMDB_movies_df.head()

C:\Users\Julie\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,imdb_title_id,title,year,description
0,tt0000009,Miss Jerry,1894,The adventures of a female reporter in the 1890s.
1,tt0000574,The Story of the Kelly Gang,1906,True story of notorious Australian outlaw Ned ...
2,tt0001892,Den sorte drøm,1911,Two men of high rank are both wooing the beaut...
3,tt0002101,Cleopatra,1912,The fabled queen of Egypt's affair with Roman ...
4,tt0002130,L'Inferno,1911,Loosely adapted from Dante's Divine Comedy and...

In [28]:

clean_movies_df = pd.merge(new_streaming_df,new_IMDB_movies_df,how="inner",left_on=['title','year'],right_on=['title','year'])

clean_movies_df.head()

,title,year,age,imdb,rotten tomatoes,netflix,hulu,prime video,disney+,genres,country,language,runtime,total_streaming_platforms,imdb_title_id,description
0,Inception,2010,13+,8.8,8.7,1,0,0,0,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0,1,tt1375666,A thief who steals corporate secrets through t...
1,Avengers: Infinity War,2018,13+,8.5,8.4,1,0,0,0,"Action,Adventure,Sci-Fi",United States,English,149.0,1,tt4154756,The Avengers and their allies must be willing ...
2,Django Unchained,2012,18+,8.4,8.7,1,0,0,0,"Drama,Western",United States,"English,German,French,Italian",165.0,1,tt1853728,"With the help of a German bounty hunter, a fre..."
3,Taxi Driver,1976,18+,8.3,9.5,1,0,0,0,"Crime,Drama",United States,"English,Spanish",114.0,1,tt0075314,A mentally unstable veteran works as a nightti...
4,3 Idiots,2009,13+,8.4,10.0,1,0,1,0,"Comedy,Drama",India,"Hindi,English",170.0,2,tt1187043,Two friends are searching for their long lost ...

In [29]:
titles_csv = "Resources/IMDb_title.csv"
titles_df = pd.read_csv(titles_csv)
titles_df.head()
clean_titles_df = titles_df[['imdb_title_id','imdb_name_id','category']]

In [30]:
names_csv = "Resources/IMDb_names.csv"
names_df = pd.read_csv(names_csv)
names_df.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,date_of_birth,place_of_birth,death_details,date_of_death,place_of_death,reason_of_death,spouses_string,spouses,divorces,spouses_with_children,children
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,"Los Angeles, California, USA",pneumonia,Robyn Smith (27 June 1980 - 22 June 1987) (hi...,2,0,1,2
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,"New York City, New York, USA",stroke,Jason Robards (4 July 1961 - 10 September 196...,2,1,2,3
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934-09-28,"Paris, France",NaN,NaN,NaN,NaN,Bernard d'Ormale (16 August 1992 - present)\n...,4,3,1,1
3,nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,"Hollywood, Los Angeles, California, USA",acute cocaine and heroin intoxication,Judith Belushi-Pisano (31 December 1976 - 5 M...,1,0,0,0
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,"Fårö, Gotlands län, Sweden",natural causes,Ingrid Bergman (11 November 1971 - 20 May 199...,5,4,5,8

In [31]:
names_df_1 = names_df.copy()

#split spouse streing
names_df_1['spouse_last'] = names_df_1['spouses_string'].str.split('(', expand=True)[0]

#split names for places of birth 
names_df_2 = names_df_1.copy()
names_df_2['place_of_birth_1'] = names_df_1['place_of_birth'].str.split(',', expand=True)[0]
names_df_2['place_of_birth_2'] = names_df_2['place_of_birth'].str.split(',', expand=True)[1]
names_df_2['place_of_birth_3'] = names_df_2['place_of_birth'].str.split(',', expand=True)[2]
names_df_2['place_of_birth_4'] = names_df_2['place_of_birth'].str.split(',', expand=True)[3]
names_df_2.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,date_of_birth,place_of_birth,death_details,date_of_death,...,spouses_string,spouses,divorces,spouses_with_children,children,spouse_last,place_of_birth_1,place_of_birth_2,place_of_birth_3,place_of_birth_4
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,...,Robyn Smith (27 June 1980 - 22 June 1987) (hi...,2,0,1,2,Robyn Smith,Omaha,Nebraska,USA,None
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,...,Jason Robards (4 July 1961 - 10 September 196...,2,1,2,3,Jason Robards,The Bronx,New York City,New York,USA
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934-09-28,"Paris, France",NaN,NaN,...,Bernard d'Ormale (16 August 1992 - present)\n...,4,3,1,1,Bernard d'Ormale,Paris,France,None,None
3,nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,...,Judith Belushi-Pisano (31 December 1976 - 5 M...,1,0,0,0,Judith Belushi-Pisano,Chicago,Illinois,USA,None
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,...,Ingrid Bergman (11 November 1971 - 20 May 199...,5,4,5,8,Ingrid Bergman,Uppsala,Uppsala län,Sweden,None

In [32]:
#split locations for places of death
names_df_3 = names_df_2.copy()
names_df_3['place_of_death_1'] = names_df_2['place_of_death'].str.split(',', expand=True)[0]
names_df_3['place_of_death_2'] = names_df_2['place_of_death'].str.split(',', expand=True)[1]
names_df_3['place_of_death_3'] = names_df_2['place_of_death'].str.split(',', expand=True)[2]
names_df_3['place_of_death_4'] = names_df_2['place_of_death'].str.split(',', expand=True)[3]
names_df_3.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,date_of_birth,place_of_birth,death_details,date_of_death,...,children,spouse_last,place_of_birth_1,place_of_birth_2,place_of_birth_3,place_of_birth_4,place_of_death_1,place_of_death_2,place_of_death_3,place_of_death_4
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,...,2,Robyn Smith,Omaha,Nebraska,USA,None,Los Angeles,California,USA,None
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,...,3,Jason Robards,The Bronx,New York City,New York,USA,New York City,New York,USA,None
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934-09-28,"Paris, France",NaN,NaN,...,1,Bernard d'Ormale,Paris,France,None,None,NaN,NaN,NaN,NaN
3,nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,...,0,Judith Belushi-Pisano,Chicago,Illinois,USA,None,Hollywood,Los Angeles,California,USA
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,...,8,Ingrid Bergman,Uppsala,Uppsala län,Sweden,None,Fårö,Gotlands län,Sweden,None

In [33]:
# Rename to clarify column unit of measure
clean_names_df = names_df_3.rename(columns={
    'height': 'height_cm'
})

# Drop unnecessary columns and reorder
clean_names_df = clean_names_df[['imdb_name_id',
                         'name',
                         'birth_name',
                         'height_cm',
                         'bio',
                         'date_of_birth',
                         'place_of_birth_1',
                         'place_of_birth_2',
                         'place_of_birth_3',
                         'place_of_birth_4',
                         'date_of_death',
                         'place_of_death_1',
                         'place_of_death_2',
                         'place_of_death_3',
                         'place_of_death_4',
                         'reason_of_death',
                         'spouse_last',
                         'spouses',
                         'divorces',
                         'spouses_with_children',
                         'children'
                        ]]

clean_names_df.set_index('imdb_name_id', inplace=True)
clean_names_df

,name,birth_name,height_cm,bio,date_of_birth,place_of_birth_1,place_of_birth_2,place_of_birth_3,place_of_birth_4,date_of_death,place_of_death_1,place_of_death_2,place_of_death_3,place_of_death_4,reason_of_death,spouse_last,spouses,divorces,spouses_with_children,children
imdb_name_id,,,,,,,,,,,,,,,,,,,,
nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...",1899-05-10,Omaha,Nebraska,USA,None,1987-06-22,Los Angeles,California,USA,None,pneumonia,Robyn Smith,2,0,1,2
nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,1924-09-16,The Bronx,New York City,New York,USA,2014-08-12,New York City,New York,USA,None,stroke,Jason Robards,2,1,2,3
nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...",1934-09-28,Paris,France,None,None,NaN,NaN,NaN,NaN,NaN,NaN,Bernard d'Ormale,4,3,1,1
nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...",1949-01-24,Chicago,Illinois,USA,None,1982-03-05,Hollywood,Los Angeles,California,USA,acute cocaine and heroin intoxication,Judith Belushi-Pisano,1,0,0,0
nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...",1918-07-14,Uppsala,Uppsala län,Sweden,None,2007-07-30,Fårö,Gotlands län,Sweden,None,natural causes,Ingrid Bergman,5,4,5,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
nm5474275,Sunay Terzioglu,Sunay Terzioglu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,0,0,0
nm5909653,Sung Lim Ju,Sung Lim Ju,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,0,0,0
nm5993616,Coulee Nazha,Gülnezer Bextiyar,NaN,"Coulee Nazha was born on May 2, 1992 in Urumqi...",1992-05-02,Urumqi,Xinjiang,China,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,0,0,0
nm7634163,Ge Ou,Ge Ou,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,0,0,0
nm3834123,Richa Langella,Richa Langella,170.0,"Richa Langella, formerly known as Richa Gangop...",1986-03-20,New Delhi,India,None,None,NaN,NaN,NaN,NaN,NaN,NaN,Joe Langella,1,0,0,0

In [34]:
#create connection to db
db_connection_string = "julie:pass@localhost:5432/movie_db"

engine = create_engine(f'postgresql://{db_connection_string}')

In [35]:
#check for table names
engine.table_names()

[]

In [36]:
#load movies table
clean_movies_df.to_sql(name="movies",con=engine,if_exists='append',index=False)

In [37]:
#load titles table
clean_titles_df.to_sql(name="titles",con=engine,if_exists='append',index=False)

In [38]:
#load names database
clean_names_df.to_sql(name="names",con=engine,if_exists='append',index=False)

In [39]:
#query movies on three streaming platforms
print("Movies on three streaming platforms:")

pd.read_sql_query('select title from movies where total_streaming_platforms=3',con=engine)

Movies on three streaming platforms:

                   title
0          The Interview
1                 Blame!
2              Evolution
3  No Game No Life: Zero
4                The Kid
5             Inside Out